api/app/models/tax_table.rb

SELECT "tax_tables".* FROM "tax_tables" WHERE "tax_tables"."tax_year" = 2026 AND "tax_tables"."filing_status" = 'single' AND "tax_tables"."pay_frequency" = 'biweekly' LIMIT 1
---
  def self.find_table(tax_year:, filing_status:, pay_frequency:)