api/app/controllers/api/v1/admin/departments_controller.rb

        def index
          departments = Department.where(company_id: params[:company_id])
          departments = departments.where(active: params[:active]) if params[:active].present?
          departments = departments.left_joins(:employees)
                                   .select("departments.*, COUNT(employees.id) as employee_count")
                                   .group("departments.id")
                                   .order(:name)
---
SELECT departments.*, COUNT(employees.id) as employee_count FROM "departments" LEFT OUTER JOIN "employees" ON "employees"."department_id" = "departments"."id" WHERE "departments"."company_id" = $1 AND "departments"."active" = $2 GROUP BY "departments"."id" ORDER BY "departments"."name" ASC  [["company_id", 72], ["active", true]]

        def create
          department = Department.new(department_params)

          if department.save
---
INSERT INTO "departments" ("active", "company_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["active", true], ["company_id", 75], ["created_at", "2026-02-05 11:25:26.471172"], ["name", "Engineering"], ["updated_at", "2026-02-05 11:25:26.471172"]]

        def update
          if @department.update(department_params)
---
UPDATE "departments" SET "name" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["name", "Updated"], ["updated_at", "2026-02-05 11:25:26.484249"], ["id", 98]]

        def set_department
          @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 99999], ["LIMIT", 1]]