api/app/controllers/api/v1/admin/employees_controller.rb

SELECT COUNT(*) FROM "employees" WHERE "employees"."company_id" = $1  [["company_id", 45]]
SELECT "departments".* FROM "departments" WHERE "departments"."id" IN ($1, $2)  [["id", 43], ["id", 44]]
SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = $1 AND (first_name ILIKE $2 OR last_name ILIKE $3 OR email ILIKE $4) ORDER BY "employees"."last_name" ASC, "employees"."first_name" ASC LIMIT $5 OFFSET $6  [["company_id", 42], [nil, "%searchable%"], [nil, "%searchable%"], [nil, "%searchable%"], ["LIMIT", 25], ["OFFSET", 0]]
SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1  [["id", 45]]
---
        def index
          employees = Employee.where(company_id: params[:company_id])
          employees = apply_filters(employees)
          employees = employees.includes(:department).order(:last_name, :first_name)
          employees = employees.page(params[:page]).per(params[:per_page] || 25)

INSERT INTO "employees" ("additional_withholding", "address_line1", "address_line2", "allowances", "bank_account_number_encrypted", "bank_routing_number_encrypted", "city", "company_id", "created_at", "date_of_birth", "department_id", "email", "employment_type", "filing_status", "first_name", "hire_date", "last_name", "middle_name", "pay_frequency", "pay_rate", "phone", "retirement_rate", "roth_retirement_rate", "ssn_encrypted", "state", "status", "termination_date", "updated_at", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
---
        def create
          employee = Employee.new(employee_params)

          if employee.save

UPDATE "employees" SET "first_name" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["first_name", "Updated"], ["updated_at", "2026-02-05 11:24:00.212578"], ["id", 56]]
---
        def update
          if @employee.update(employee_params)

UPDATE "employees" SET "status" = $1, "termination_date" = $2, "updated_at" = $3 WHERE "employees"."id" = $4  [["status", "terminated"], ["termination_date", "2026-02-05"], ["updated_at", "2026-02-05 11:24:00.229809"], ["id", 59]]
---
        def destroy
          @employee.update!(status: "terminated", termination_date: Date.current)