api/app/controllers/api/v1/admin/pay_periods_controller.rb

        def index
          @pay_periods = PayPeriod.where(company_id: current_company_id)
                                   .includes(:payroll_items)
                                   .order(pay_date: :desc)

          # Filter by status
          @pay_periods = @pay_periods.where(status: params[:status]) if params[:status].present?
---
SELECT "pay_periods".* FROM "pay_periods" WHERE "pay_periods"."company_id" = $1 ORDER BY "pay_periods"."pay_date" DESC  [["company_id", 271]]
SELECT "pay_periods".* FROM "pay_periods" WHERE "pay_periods"."company_id" = $1 AND "pay_periods"."status" = $2 ORDER BY "pay_periods"."pay_date" DESC  [["company_id", 272], ["status", "draft"]]