api/app/controllers/api/v1/admin/pay_periods_controller.rb

        def approve
          unless @pay_period.calculated?
            return render json: { error: "Can only approve a calculated pay period" }, status: :unprocessable_entity
          end

          @pay_period.update!(
            status: "approved",
            approved_by_id: current_user_id,
            approved_at: Time.current
          )
---
UPDATE "pay_periods" SET "approved_by_id" = $1, "status" = $2, "updated_at" = $3 WHERE "pay_periods"."id" = $4  [["approved_by_id", 1], ["status", "approved"], ["updated_at", "2026-02-05 12:02:41.817698"], ["id", 62]]

        def commit
          unless @pay_period.approved?
            return render json: { error: "Can only commit an approved pay period" }, status: :unprocessable_entity
          end

          unless @pay_period.payroll_items.exists?
            return render json: { error: "Cannot commit pay period with no payroll items" }, status: :unprocessable_entity
          end

          ActiveRecord::Base.transaction do
            @pay_period.update!(
              status: "committed",
              committed_at: Time.current,
              committed_by_id: current_user_id
            )
            committed_items = @pay_period.payroll_items.includes(
              :employee,
              payroll_item_deductions: :deduction_type,
              employee: { employee_loans: :loan_transactions }
            ).to_a

            # Preload YTD records to avoid N find_or_create_by calls per item
            year = @pay_period.pay_date.year
            employee_ids = committed_items.map(&:employee_id).uniq

            emp_ytds = EmployeeYtdTotal.where(employee_id: employee_ids, year: year).index_by(&:employee_id)
            employee_ids.each do |eid|
              emp_ytds[eid] ||= EmployeeYtdTotal.find_or_create_by!(employee_id: eid, year: year)
---
UPDATE "pay_periods" SET "committed_at" = $1, "status" = $2, "updated_at" = $3 WHERE "pay_periods"."id" = $4  [["committed_at", "2026-02-05 12:02:41.838659"], ["status", "committed"], ["updated_at", "2026-02-05 12:02:41.838730"], ["id", 64]]
SELECT "employee_ytd_totals".* FROM "employee_ytd_totals" WHERE "employee_ytd_totals"."employee_id" = $1 AND "employee_ytd_totals"."year" = $2 LIMIT $3  [["employee_id", 247], ["year", 2026], ["LIMIT", 1]]
INSERT INTO "employee_ytd_totals" ("bonus", "created_at", "employee_id", "gross_pay", "insurance", "loans", "medicare_tax", "net_pay", "overtime_pay", "retirement", "roth_retirement", "social_security_tax", "tips", "updated_at", "withholding_tax", "year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"