api/app/controllers/api/v1/admin/pay_periods_controller.rb

SELECT COUNT(*) FROM "pay_periods" WHERE "pay_periods"."company_id" = $1  [["company_id", 271]]
SELECT COUNT(*) AS "count_all", "pay_periods"."status" AS "pay_periods_status" FROM "pay_periods" WHERE "pay_periods"."company_id" = $1 GROUP BY "pay_periods"."status"  [["company_id", 271]]
---
        def index
          @pay_periods = PayPeriod.where(company_id: current_company_id)
                                   .includes({ payroll_items: :legacy_disposition }, :voided_by, :correction_events, :company_workweek,
                                             :supplemental_pay_periods)
                                   .period_reverse_chronological

          # Filter by status
          @pay_periods = @pay_periods.where(status: params[:status]) if params[:status].present?

          # Filter by year
          @pay_periods = @pay_periods.for_year(params[:year].to_i) if params[:year].present?

          loaded = @pay_periods.to_a
          preload_pay_period_audit_logs!(loaded)
          preload_pay_period_pay_date_corrections!(loaded)
          preload_pay_period_created_users!(loaded)
          render json: {
            pay_periods: loaded.map { |pp| pay_period_json(pp) },
            meta: {
              total: loaded.size,
              statuses: PayPeriod.where(company_id: current_company_id).group(:status).count

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 274], ["LIMIT", 1]]
INSERT INTO "pay_periods" ("approved_by_id", "committed_at", "company_id", "created_at", "created_by_id", "end_date", "notes", "pay_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
        def create
          attrs = pay_period_params.to_h
          starting_check_number = attrs.delete("starting_check_number")
          intent_was_submitted = attrs["run_purpose"].present? || attrs.key?("includes_base_salary") || attrs.key?("includes_recurring_items")
          attrs["run_purpose"] ||= "regular"
          attrs["run_purpose_source"] = "operator_selected" if intent_was_submitted
          attrs["includes_base_salary"] = attrs["run_purpose"] == "regular" unless attrs.key?("includes_base_salary")
          attrs["includes_recurring_items"] = attrs["run_purpose"] == "regular" unless attrs.key?("includes_recurring_items")
          gate = PayrollGoLiveGate.new(company: current_company, pay_date: attrs["pay_date"])
          if gate.comparison_only? && starting_check_number.present?
            raise ArgumentError, "Starting check number is not used for comparison runs"
          end
          attrs["parallel_run"] = true if gate.comparison_only?
          @pay_period = PayPeriod.new(attrs)
          @pay_period.company_id = current_company_id
          @pay_period.status = "draft"

          ActiveRecord::Base.transaction do
            if starting_check_number.present?
              locked_company = Company.lock.find(current_company_id)
              apply_starting_check_number!(starting_check_number, company: locked_company)
            end
            @pay_period.save!

UPDATE "pay_periods" SET "notes" = $1, "updated_at" = $2 WHERE "pay_periods"."id" = $3  [["notes", "Updated notes"], ["updated_at", "2026-02-05 12:02:41.781208"], ["id", 56]]
---
                update_attributes["includes_base_salary"] = update_attributes["run_purpose"] == "regular" unless update_attributes.key?("includes_base_salary")
                update_attributes["includes_recurring_items"] = update_attributes["run_purpose"] == "regular" unless update_attributes.key?("includes_recurring_items")
              end
              @pay_period.update!(update_attributes)

SELECT "pay_periods".* FROM "pay_periods" WHERE "pay_periods"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
---
        def destroy
          if @pay_period.correction_run?
            unless @pay_period.draft?
              return render json: { error: "Can only delete draft correction run pay periods" }, status: :unprocessable_entity
            end

            # CPR-73: accept an operator-supplied reason for audit clarity
            deletion_reason = params[:reason].to_s.strip
            if deletion_reason.blank?
              deletion_reason = "Draft correction run deleted by operator"
            end

            begin
              if @pay_period.source_pay_period_id.blank?
                return render json: { error: "Cannot delete orphaned correction run without source linkage" }, status: :unprocessable_entity
              end

              deleted_run_id = @pay_period.id
              source_period  = nil
              source_period_id = nil
              correction_event = nil

              ActiveRecord::Base.transaction do
                locked_run = PayPeriod.lock("FOR UPDATE").find(@pay_period.id)

SELECT "payroll_items".* FROM "payroll_items" WHERE "payroll_items"."pay_period_id" = $1  [["pay_period_id", 58]]
---
                source_period_id = source.id
              end

              source_period = PayPeriod.includes(:payroll_items, :voided_by, :source_pay_period, :correction_events)
                                     .find(source_period_id)

DELETE FROM "pay_periods" WHERE "pay_periods"."id" = $1  [["id", 58]]
---
          end

          ActiveRecord::Base.transaction do
            PayrollImportRecord.where(pay_period_id: @pay_period.id).delete_all

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 AND "employees"."company_id" = $2 LIMIT $3  [["id", 257], ["company_id", 294], ["LIMIT", 1]]
SELECT "payroll_items".* FROM "payroll_items" WHERE "payroll_items"."pay_period_id" = $1 AND "payroll_items"."employee_id" = $2 LIMIT $3  [["pay_period_id", 92], ["employee_id", 271], ["LIMIT", 1]]
SELECT 1 AS one FROM "payroll_items" WHERE "payroll_items"."employee_id" = $1 AND "payroll_items"."pay_period_id" = $2 LIMIT $3  [["employee_id", 302], ["pay_period_id", 127], ["LIMIT", 1]]
---
        def run_payroll
          unless @pay_period.draft? || @pay_period.calculated?
            return render json: { error: "Can only run payroll on draft or calculated pay periods" }, status: :unprocessable_entity
          end
          if params.key?(:named_loan_payments) && !params[:named_loan_payments].respond_to?(:to_unsafe_h)
            return render json: { error: "Named loan inputs must be an object keyed by employee" }, status: :unprocessable_entity
          end

          PayrollGoLiveGate.new(company: @pay_period.company, pay_date: @pay_period.pay_date)
            .require_live_payroll!(parallel_run: @pay_period.parallel_run?)

          # Determine which employees to calculate:
          # 1. If explicit employee_ids are passed, use those
          # 2. If imported payroll items exist, use imported employees + salary + contractors
          #    (don't auto-create hourly employees not present in the import)
          # 3. Otherwise, include all active employees for normal payroll runs/recalculations
          submitted_employee_ids = submitted_payroll_employee_ids
          excluded_employee_ids = @pay_period.pay_period_excluded_employees.pluck(:employee_id)
          if params.key?(:employee_ids) && Array(params[:employee_ids]).empty?
            return render json: { error: "Select at least one employee before calculating payroll" }, status: :unprocessable_entity
          end
          employee_ids = if params.key?(:employee_ids)
            Array(params[:employee_ids])
          elsif @pay_period.correction_run?
            @pay_period.payroll_items.pluck(:employee_id)
          elsif @pay_period.payroll_items.where.not(import_source: [ nil, "" ]).exists?

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 271], ["LIMIT", 1]]
SELECT "employees"."id" FROM "employees" WHERE "employees"."status" = $1 AND "employees"."company_id" = $2  [["status", "active"], ["company_id", 294]]
---

          results = { success: [], skipped: [], errors: [] }

          eligible_scope = Employee.where(id: employee_ids, company_id: current_company_id)
          eligible_scope = if params[:employee_ids].present? && %w[final correction adjustment].include?(@pay_period.run_purpose)
            eligible_scope.where(status: %w[active terminated])

INSERT INTO "payroll_items" ("additional_withholding", "bonus", "check_number", "check_printed_at", "created_at", "custom_columns_data", "employee_id", "employment_type", "gross_pay", "holiday_hours", "hours_worked", "insurance_payment", "loan_payment", "medicare_tax", "net_pay", "overtime_hours", "pay_period_id", "pay_rate", "pto_hours", "reported_tips", "retirement_payment", "roth_retirement_payment", "social_security_tax", "total_additions", "total_deductions", "updated_at", "withholding_tax", "ytd_gross", "ytd_medicare_tax", "ytd_net", "ytd_retirement", "ytd_roth_retirement", "ytd_social_security_tax", "ytd_withholding_tax") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34) RETURNING "id"
---
              payroll_item.payment_delivery_method ||= employee.payment_delivery_method.presence || "paper_check"

              sync_pay_rate_from_employee(payroll_item, employee) unless @preserve_entered_pay_rates || @pay_period.correction_run?
              payroll_item.sync_default_custom_earnings!(employee)

UPDATE "pay_periods" SET "status" = $1, "updated_at" = $2 WHERE "pay_periods"."id" = $3  [["status", "calculated"], ["updated_at", "2026-02-05 12:04:42.025516"], ["id", 127]]
---
                intake_stale_session: nil
              )
            end
            @pay_period.update!(calculation_attributes)

SELECT "pay_periods".* FROM "pay_periods" WHERE "pay_periods"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
SELECT "payroll_items".* FROM "payroll_items" WHERE "payroll_items"."pay_period_id" = $1  [["pay_period_id", 64]]
SELECT COUNT(*) FROM "payroll_items" WHERE "payroll_items"."pay_period_id" = $1  [["pay_period_id", 92]]
---
        def set_pay_period
          # `:supplemental_pay_periods` is eager-loaded so that
          # `pay_period_json` can call `pay_period.supplemental_pay_periods.size`
          # for the `supplemental_pay_periods_count` field without firing an
          # extra `SELECT COUNT(*)` query on every show/update/etc. request.
          @pay_period = PayPeriod
            .includes(:payroll_items, :voided_by, :source_pay_period, :company_workweek,
                      :correction_events, :supplemental_pay_periods)
            .find(params[:id])